IDEA Open Model
CrossSectionGeneralColdFormed Properties
Compatible with IDEA StatiCa 20.1
The CrossSectionGeneralColdFormed type exposes the following members.
Properties
Name | Description
Centerline
 Centerline of cross-section made from linear segments
CrossSectionRotation
 Rotation of Cross - Section
 (Inherited from CrossSection.)
CrossSectionType
 Type of cross-section
Id
 Element Id
 (Inherited from OpenElementId.)
Material
 Material of cross-section
Name
 Name of cross-section
 (Inherited from CrossSection.)
Radius
 Inner rounding radius between linear segments of centerline
Thickness
 Thickness of thin wall cross-section
Top
See Also
Reference
CrossSectionGeneralColdFormed Class
IdeaRS.OpenModel.CrossSection Namespace